{"posts":[{"date":"May - 2023","text":"Já faz um tempo desde minha última postagem e desta vez venho compartilhar este projeto que deu trabalho, mas o resultado é bastante satisfatório, trata-se de uma plataforma de transmissão de animes, que dei o nome de Myanimes, a plataforma possui inúmeras funcionalidades , entre eles:\n\n-Sistema de cadastro e login\n\n-Sistema de recuperação de senha por e-mail\n\n-Senha de troca do sistema\n\n-Sistema de registro de séries\n\n-Sistema de registro de episódios\n\n\n\nAlém de inúmeros outros sistemas, o front end foi praticamente feito do zero, sem o uso de frameworks para praticar mais minhas habilidades de front end, no front end html, css, javascript vanilla, toastr, axios, jQuey e uma lib para icones .\n\n\n\nBack-end: Node.JS, Nodemailer, JWT, Multer, Bcrypt, Express, Express-Session, Docker (MySQL) e Sequelize\n\n\n\n\n\nCódigo fonte:\n\nhttps://lnkd.in/dSVtYdfF","src":"./video/myanimes.mp4"},{"date":"October - 2022","text":"desta vez venho compartilhar esse projeto feito com Node.js + socket.io, trata-se de um jogo multi-player de perguntas e respostas, foi um pouco trabalhoso sincronizar os clients, mas o resultado final me agradou batante, gostaria da opinião de vocês. O back-end foi feito com as seguintes tecnologias: Node.js, express, sequelize, mySql e socket.io Front-end: Html, css, javaScript vanilla, Bootstrap, EJS e socket.io client Caso tenham interesse, o código stá disponível no meu repositório no gtihub: https://github.com/YrllanBrandao/trivia-game-multiplayer","src":"./video/trivia.mp4"},{"date":"September - 2022","text":"Tirei algumas horas pra criar esse portal aluno-professor utilizando node.js no back-end, o portal utiliza o conceito de multi-usuário onde aluno, professor e administrador são tipos diferentes de usuários e possuem diferentes funcionalidades.\n\nO projeto também contém mais recursos como:\n1. Os professores podem adicionar ou editar as notas de seus alunos após adicioná-los à turma.\n2. Os professores também podem escrever um aviso que será enviado a todos os alunos da sua turma.\n3. Os professores podem fazer upload de tarefas que serão enviadas a todos os alunos da turma e os alunos podem fazer o download das tarefas.\n4. Os alunos também podem enviar seus trabalhos, mas uma vez enviados não podem ser alterados posteriormente.\n5. Os professores também podem ver todas as notas atribuídas por eles a um aluno através do seu perfil de notas e podem editá-las se necessário.\n6. Os alunos podem ver as notas dadas pelos professores na seção de notas.\n7. O usuário pode ver seu perfil através da opção de perfil.\ne muitas outras funcionalidades\n\nback-end: Node.js, express, express-sessions, sequelize, mysql e bcrypt e ejs como view engine\nFront-end: html, css, javascript vanilla, bootstrap.\n\nAinda falta adicionar algumas funcionalidades, mas vou adicionando ao longo dos próximos dias.\n\nO projeto tá disponível no meu repositório no link a seguir:\nhttps://lnkd.in/d7i44pC4","src":"./video/classmanager.mp4"}]}
